app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
    def index
        @articles= Article.paginate(page: params[:page], per_page: 5).publicados.ultimos

UPDATE "articles" SET "visits_counts" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["visits_counts", 1], ["updated_at", "2020-12-04 12:56:02.586908"], ["id", 9]]
---
    def show
        @article.update_visits_count

SELECT "categories".* FROM "categories"
---
    def new
        @article= Article.new
        @categories= Category.all

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "a ver si anda "], ["body", "probando si anda las asociaciones de user id"], ["created_at", "2020-12-03 19:29:01.884355"], ["updated_at", "2020-12-03 19:29:01.884355"], ["user_id", 1]]
INSERT INTO "has_categories" ("article_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 12], ["category_id", 1], ["created_at", "2020-12-07 19:58:52.385225"], ["updated_at", "2020-12-07 19:58:52.385225"]]
---
    def create
        @article=current_user.articles.new(article_params)
        @article.categories=params[:categories]
        if @article.save

UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "Bienvenidos a mi blog. asgkasgjfa"], ["updated_at", "2020-12-02 14:19:21.091928"], ["id", 1]]
---
    def update

        if @article.update(article_params)